grtwf/test/startProcess1

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:web="http://webservice.grtwf.uaf.com/">
   <soapenv:Header/>
   <soapenv:Body>
      <web:startProcess>
         <!--Optional:-->
         <arg0>admin</arg0>
         <!--Optional:-->
         <arg1>bu2</arg1>
         <arg2>
         </arg2>
      </web:startProcess>
   </soapenv:Body>
</soapenv:Envelope>